["#01223_227330", "#01223_241387", "#01223_244149", "#01223_244277", "#01223_244955", "#01223_247877", "#01223_248882", "#01223_249955", "#01223_259988", "#01223_276182", "#01223_277977", "#01223_301761", "#01223_302010", "#01223_302330", "#01223_302800", "#01223_306306", "#01223_307030", "#01223_307581", "#01223_308681", "#01223_308871", "#01223_309147", "#01223_311053", "#01223_311911", "#01223_312598", "#01223_315232", "#01223_323178", "#01223_323361", "#01223_323639", "#01223_323737", "#01223_324033", "#01223_327908", "#01223_329432", "#01223_337766", "#01223_350106", "#01223_350420", "#01223_350688", "#01223_351707", "#01223_351880", "#01223_352500", "#01223_352607", "#01223_353110", "#01223_353942", "#01223_354382", "#01223_354755", "#01223_355166", "#01223_356060", "#01223_356354", "#01223_356555", "#01223_356666", "#01223_358399", "#01223_359506", "#01223_360409", "#01223_360966", "#01223_361763", "#01223_362054", "#01223_362372", "#01223_362433", "#01223_362456", "#01223_362525", "#01223_363270", "#01223_363471", "#01223_364917", "#01223_365068", "#01223_365599", "#01223_366552", "#01223_366668", "#01223_367660", "#01223_367755", "#01223_368786", "#01223_369299", "#01223_400170", "#01223_412299", "#01223_412430", "#01223_413000", "#01223_448620", "#01223_461661", "#01223_462354", "#01223_464550", "#01223_464630", "#01223_500005", "#01223_505015", "#01223_506055", "#01223_518111", "#01223_566188", "#01223_566388", "#01223_568988", "#01223_577786", "#01223_727410", "#01223_812660", "#01462_432565", "#01733_553355", "#01799_521260", "#01842_753771", "#0871_942_9180", "#100_mill_road_city_centre", "#106_regent_street_city_centre", "#108_regent_street_city_centre", "#10_homerton_street_city_centre", "#11_peas_hill_city_centre", "#12_bridge_street_city_centre", "#12_lensfield_road_city_centre", "#12_market_hill_city_centre", "#12_norfolk_street_city_centre", "#12_st._johns_street_city_centre", "#14_-16_bridge_street", "#152_-_154_hills_road", "#15_-_19_trumpington_street", "#15_magdalene_street_city_centre", "#169_high_street_chesterton_chesterton", "#17_magdalene_street_city_centre", "#183_east_road_city_centre", "#191_histon_road_chesterton", "#196_mill_road_city_centre", "#205_victoria_road_chesterton", "#20_milton_road_chesterton", "#21_-_24_northampton_road", "#21_-_24_northampton_street", "#21_burleigh_street_city_centre", "#22_chesterton_road_chesterton", "#24_green_street_city_centre", "#290_mill_road_city_centre", "#2_rose_crescent_city_centre", "#2_sturton_street_city_centre", "#2g_cambridge_leisure_park_cherry_hinton_road_cherry_hinton", "#30_bridge_street_city_centre", "#31_newnham_road_newnham", "#32_bridge_street_city_centre", "#33-34_saint_andrews_street", "#33_bridge_street", "#34_-_35_green_street", "#35_newnham_road_newnham", "#35_saint_andrews_street_city_centre", "#36_saint_andrews_street", "#37_newnham_road_newnham", "#39_burleigh_street_city_centre", "#3_-_5_millers_yard_mill_lane", "#40210_millers_yard_city_centre", "#40270_king_street_city_centre", "#40428_king_street_city_centre", "#41518_castle_street_city_centre", "#43_high_street_cherry_hinton_cherry_hinton", "#451_newmarket_road_fen_ditton", "#47-53_regent_street", "#4_-_6_rose_crescent", "#4_kings_parade_city_centre", "#51_trumpington_street_city_centre", "#529_newmarket_road_fen_ditton", "#59_hills_road_city_centre", "#5_jordans_yard_bridge_street_city_centre", "#64_cherry_hinton_road_cherry_hinton", "#66_chesterton_road_chesterton", "#68_histon_road_chesterton", "#6_lensfield_road", "#71_castle_street_city_centre", "#72_regent_street_city_centre", "#74_mill_road_city_centre", "#7_barnwell_road_fen_ditton", "#7_milton_road_chesterton", "#82_cherry_hinton_road_cherry_hinton", "#83_regent_street", "#84_regent_street_city_centre", "#86_regent_street_city_centre", "#88_mill_road_city_centre", "#afghan", "#african", "#ali_baba", "#anatolia", "#asian_oriental", "#ask", "#australasian", "#australian", "#austrian", "#backstreet_bistro", "#bangkok_city", "#barbeque", "#basque", "#bedouin", "#belgian", "#bistro", "#bloomsbury_restaurant", "#brazilian", "#bridge_street_city_centre", "#british", "#c.b_1,", "#c.b_2,", "#c.b_25,", "#c.b_3,", "#c.b_4,", "#c.b_5,", "#caffe_uno", "#cambridge_leisure_park_clifton_way", "#cambridge_lodge_hotel_139_huntingdon_road_city_centre", "#cambridge_lodge_restaurant", "#cambridge_retail_park_newmarket_road_fen_ditton", "#canapes", "#cantonese", "#caribbean", "#catalan", "#catalanian", "#centre", "#charlie_chan", "#cheap", "#chinese", "#chiquito_restaurant_bar", "#christmas", "#city_stop_restaurant", "#cocum", "#corn_exchange_street", "#corsica", "#cote", "#cotto", "#creative", "#crossover", "#crowne_plaza_hotel_20_downing_street", "#cuban", "#curry_garden", "#curry_king", "#curry_prince", "#curry_queen", "#da_vinci_pizzeria", "#danish", "#darrys_cookhouse_and_wine_shop", "#de_luca_cucina_and_bar", "#de_vere_university_arms_regent_street_city_centre", "#dojo_noodle_bar", "#don_pasquale_pizzeria", "#dontcare", "#doubletree_by_hilton_cambridge_granta_place_mill_lane", "#east", "#efes_restaurant", "#english", "#eraina", "#eritrean", "#european", "#expensive", "#finders_corner_newmarket_road", "#fitzbillies_restaurant", "#frankie_and_bennys", "#free_school_lane_city_centre", "#french", "#fusion", "#g4_cambridge_leisure_park_clifton_way_cherry_hinton", "#galleria", "#gastropub", "#german", "#golden_house", "#golden_wok", "#gourmet_burger_kitchen", "#graffiti", "#grafton_hotel_619_newmarket_road_fen_ditton", "#grafton_hotel_restaurant", "#greek", "#hakka", "#halal", "#hk_fusion", "#hotel_du_vin_and_bistro", "#hotel_felix_whitehouse_lane_huntingdon_road", "#hungarian", "#india_house", "#indian", "#indians", "#indonesian", "#international", "#irish", "#italian", "#j_restaurant", "#jamaican", "#japanese", "#jinling_noodle_bar", "#king_street_city_centre", "#kohinoor", "#korean", "#kosher", "#kymmoy", "#la_margherita", "#la_mimosa", "#la_raza", "#la_tasca", "#lan_hong_house", "#lebanese", "#little_seoul", "#loch_fyne", "#mahal_of_cambridge", "#maharajah_tandoori_restaurant", "#malaysian", "#market_hill_city_centre", "#mediterranean", "#meghna", "#mexican", "#meze_bar_restaurant", "#michaelhouse_cafe", "#middle_eastern", "#midsummer_common", "#midsummer_house_restaurant", "#milton_road_chesterton", "#moderate", "#moderately", "#modern_european", "#moroccan", "#nandos", "#nandos_city_centre", "#newmarket_road_fen_ditton", "#north", "#north_american", "#panahar", "#panasian", "#peking_restaurant", "#persian", "#pipasha_restaurant", "#pizza_express", "#pizza_hut", "#pizza_hut_cherry_hinton", "#pizza_hut_city_centre", "#pizza_hut_fen_ditton", "#polish", "#polynesian", "#portuguese", "#prezzo", "#quayside_off_bridge_street", "#rajmahal", "#regent_street_city_centre", "#restaurant_alimentum", "#restaurant_one_seven", "#restaurant_two_two", "#rice_boat", "#rice_house", "#riverside_brasserie", "#romanian", "#royal_spice", "#royal_standard", "#russian", "#saffron_brasserie", "#saigon_city", "#saint_johns_chop_house", "#sala_thong", "#scandinavian", "#scottish", "#seafood", "#sesame_restaurant_and_bar", "#shanghai_family_restaurant", "#shiraz_restaurant", "#singaporean", "#sitar_tandoori", "#south", "#spanish", "#st._michael's_church_trinity_street_city_centre", "#stazione_restaurant_and_coffee_bar", "#steakhouse", "#swedish", "#swiss", "#taj_tandoori", "#tandoori_palace", "#thai", "#thailand", "#thanh_binh", "#the_cambridge_chop_house", "#the_copper_kettle", "#the_cow_pizza_kitchen_and_bar", "#the_gandhi", "#the_gardenia", "#the_golden_curry", "#the_good_luck_chinese_food_takeaway", "#the_hotpot", "#the_little_rose_37_trumpington_street", "#the_lucky_star", "#the_missing_sock", "#the_nirala", "#the_oak_bistro", "#the_river_bar_steakhouse_and_grill", "#the_slug_and_lettuce", "#the_varsity_restaurant", "#thompsons_lane_fen_ditton", "#traditional", "#travellers_rest", "#turkish", "#tuscan", "#ugly_duckling", "#unusual", "#vegetarian", "#venetian", "#venue", "#venues", "#victoria_avenue_chesterton", "#vietnamese", "#wagamama", "#welsh", "#west", "#world", "#yippee_noodle_bar", "#yu_garden", "#zizzi_cambridge", ",", ".", "0", "1", "2", "3", "7", "7:30", "8", "9", ";", "?", "a", "a.a", "a.b", "a.d", "a.f", "a.g", "a.h", "a.q", "a.r", "a.x", "about", "ad", "adddress", "addre", "address", "addrss", "adra", "adress", "af", "afternoon", "again", "ah", "air", "airatarin", "airitran", "all", "alright", "alternative", "am", "american", "an", "and", "another", "any", "anyone", "anything", "anywhere", "appleton", "are", "area", "arotrian", "art", "arts", "as", "asian", "at", "aw", "awesome", "b", "b#ask", "b#askaye", "b#askey", "b.d", "b.g", "back", "barbecue", "bart", "bat", "be", "belgium", "believe", "beside", "besides", "bit", "bloomsbury", "bout", "breath", "breathing", "bristish", "but", "by", "bye", "caius", "calling", "cambridge", "can", "can't", "cana", "canape", "cancun", "cannabis", "canope", "canopy", "cant", "cantonates", "care", "carrier", "center", "central", "change", "changed", "cherry", "child", "chineese", "chinses", "chiquito", "choice", "city", "class", "code", "college", "confirm", "confused", "continental", "cool", "correct", "cost", "cough", "could", "cow", "cross", "crosstalk", "cute", "d.b", "d.g", "d.p", "d.q", "d.t", "d.y", "damn", "darling", "day", "dear", "deosnt", "derately", "did", "different", "ditton", "do", "does", "doesnt", "done", "dont", "down", "downtown", "duration", "e.h", "e.p", "e.y", "ea", "earatrain", "earatree", "earetree", "eartrain", "eat", "ecuadorean", "else", "elses", "endonesian", "euorpean", "euro", "europ", "europene", "ever", "every", "excellent", "expen", "f", "fancy", "fen", "ffood", "finally", "find", "fine", "first", "fish", "foo", "food", "foods", "for", "from", "fuck", "gasper", "gastro", "get", "give", "go", "god", "gonville", "good", "goodbye", "got", "great", "h.l", "h.x", "halo", "hang", "has", "hate", "have", "hear", "hello", "help", "hi", "hinton", "his", "hm", "holy", "house", "how", "huh", "i", "iam", "id", "if", "im", "in", "inaudible", "india", "inner", "int", "is", "it", "itailian", "its", "j.j", "j.y", "just", "k", "kay", "kind", "knocking", "know", "ko", "l#east", "l.e", "l.f", "l.l", "l.n", "l.x", "laugh", "let", "lets", "like", "located", "location", "long", "loo", "looking", "ly", "mail", "malyasian", "matches", "matter", "may", "me", "meant", "medetanian", "mediteranian", "meditteranian", "medium", "medterranean", "might", "mind", "minuet", "mistakes", "moder", "moderat", "modereate", "modern", "modertley", "modreately", "moment", "more", "moroccon", "moron", "much", "music", "my", "n.f", "n.l", "n.t", "n.x", "name", "ne", "need", "needs", "new", "next", "nice", "no", "noise", "none", "not", "now", "number", "nymber", "o", "of", "oh", "ok", "okay", "old", "on", "one", "ones", "only", "ooh", "option", "options", "or", "ori", "oriental", "ostro", "other", "others", "out", "over", "p", "p.a", "p.b", "p.p", "pan", "park", "part", "parts", "phone", "pizza", "place", "plea", "please", "portugese", "portugeuse", "post", "postal", "postcode", "preference", "previews", "pri", "price", "priced", "prices", "probably", "promo", "pub", "q.a", "q.f", "q.y", "r.g", "r.h", "r.q", "ran", "range", "re", "really", "regular", "repeat", "request", "rerestaurant", "res", "rest", "restaraunt", "restauran", "restaurant", "restaurants", "restaurnt", "restuarant", "right", "ring", "romania", "s", "s.j", "s.u", "said", "say", "says", "scandanavian", "scandinavia", "scotch", "sea", "searching", "see", "selection", "sells", "ser", "serve", "served", "serves", "serving", "sh", "shit", "shitty", "should", "show", "side", "sigh", "signapore", "signaporean", "signaporian", "singapore", "so", "some", "something", "somewhere", "sorry", "sorry,", "sounds", "spani", "special", "spensive", "spice", "start", "static", "steak", "stop", "suck", "sucks", "sure", "surprise", "survey", "system", "t", "tailand", "take", "takes", "talking", "taquita", "tasty", "telephone", "tell", "test", "than", "thank", "thanks", "that", "thatll", "thats", "the", "their", "then", "there", "theres", "they", "thing", "think", "this", "though", "time", "to", "town", "train", "tran", "try", "trying", "ts", "tur", "turk", "turkey", "turkiesh", "tv_noise", "type", "types", "u.f", "u.j", "u.w", "u.y", "uh", "um", "umh", "un", "unintelligent", "unintelligible", "up", "us", "usually", "vanessa", "vegitarian", "very", "viet", "vietna", "w.r", "wait", "wanna", "want", "was", "we", "welch", "welcome", "well", "wha", "what", "whats", "where", "wheres", "wiscon", "wisconsin", "with", "wondering", "worth", "worthless", "would", "wrong", "ya", "ye", "yea", "yeah", "yes", "york", "you", "your", "yourself", "zip"]
